<!-- dflook/terraform-github-actions {"workspace":"opentofu-exclude-support-2","backend_type":"remote","backend":"f452926034c09f83b3f508ff96d26ba7f96f2ed24d02a94f5b058747eb7ffcce","plan_job_ref":"Job Test Terraform cloud #341 at https://github.com/dflook/terraform-github-actions/actions/runs/15541952720","plan_hash":"4676e675c36852d40a78dcec7eb080f4e68f6ee36b951262d1e05e010af93193","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __opentofu-exclude-support-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #341](https://github.com/dflook/terraform-github-actions/actions/runs/15541952720)